duxinglang-1/nRF9160_test/AURI_TEST/src/screen/screen.c
void NotifyScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_NOTIFY].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATED;
				
		NotifyShow();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;

}

void SOSShowStatus(void)
{
	u32_t img_addr;
	u8_t *img;
	
	LCD_Clear(BLACK);

	switch(sos_state)
	{
	case SOS_STATUS_IDLE:
		break;
		
	case SOS_STATUS_SENDING:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_ADDR;
	#else
		//img = IMG_SOS;
	#endif
		break;
	
	case SOS_STATUS_SENT:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_SEND_ADDR;
	#else
		//img = IMG_SOS_SEND;
	#endif
		break;
	
	case SOS_STATUS_RECEIVED:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_RECE_ADDR;
	#else
		//img = IMG_SOS_RECE;
	#endif
		break;
	
	case SOS_STATUS_CANCEL:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_SOS_ADDR;
	#else
		//img = IMG_SOS;
	#endif
		break;
	}

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(SOS_X, SOS_Y, img_addr);
#else
	LCD_ShowImg(SOS_X, SOS_Y, img);
#endif
}

void SOSScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SOS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SOS].status = SCREEN_STATUS_CREATED;

		SOSShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SOS].para&SCREEN_EVENT_UPDATE_SOS)
		{
			scr_msg[SCREEN_ID_SOS].para &= (~SCREEN_EVENT_UPDATE_SOS);
			SOSShowStatus();
		}

		if(scr_msg[SCREEN_ID_SOS].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_SOS].act = SCREEN_ACTION_NO;
		break;
	}
}

void SleepShowStatus(void)
{
	u16_t deep_sleep,light_sleep,total_sleep;
	u8_t *img_h,*img_m;
	unsigned char *img[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep + light_sleep;

	LCD_Clear(BLACK);

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
		img_h =  IMG_SLEEP_HR_EN;
		img_m =  IMG_SLEEP_MIN_EN;
		break;
		
	case LANGUAGE_CHN:
		img_h =  IMG_SLEEP_HR_CN;
		img_m =  IMG_SLEEP_MIN_CN;
		break;
	}

	LCD_ShowImg(SLEEP_NUM_1_X, SLEEP_NUM_1_Y, img[(total_sleep/60)/10]);
	LCD_ShowImg(SLEEP_NUM_2_X, SLEEP_NUM_2_Y, img[(total_sleep/60)%10]);
	LCD_ShowImg(SLEEP_HOUR_X, SLEEP_HOUR_Y, img_h);
	LCD_ShowImg(SLEEP_NUM_3_X, SLEEP_NUM_3_Y, img[(total_sleep%60)/10]);
	LCD_ShowImg(SLEEP_NUM_4_X, SLEEP_NUM_4_Y, img[(total_sleep%60)%10]);
	LCD_ShowImg(SLEEP_MIN_X, SLEEP_MIN_Y, img_m);
}

void SleepScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SLEEP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SLEEP].status = SCREEN_STATUS_CREATED;

		SleepShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
}

void StepsUpdateStatus(void)
{
	u16_t s_count;
	u16_t x,y;
#ifdef IMG_FONT_FROM_FLASH
	u32_t img_addr[10] = {IMG_NUM_0_ADDR,IMG_NUM_1_ADDR,IMG_NUM_2_ADDR,IMG_NUM_3_ADDR,IMG_NUM_4_ADDR,
						  IMG_NUM_5_ADDR,IMG_NUM_6_ADDR,IMG_NUM_7_ADDR,IMG_NUM_8_ADDR,IMG_NUM_9_ADDR};
#else
	unsigned char *img[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
#endif

	GetImuSteps(&s_count);

#ifdef IMG_FONT_FROM_FLASH
	x = STEPS_NUM_X;
	y = STEPS_NUM_Y;
	LCD_ShowImg_From_Flash(x, y, img_addr[s_count/10000]);
	LCD_ShowImg_From_Flash(x, y, img_addr[(s_count%10000)/1000]);
	LCD_ShowImg_From_Flash(x, y, img_addr[(s_count%1000)/100]);
	LCD_ShowImg_From_Flash(x, y, img_addr[(s_count%100)/10]);
	LCD_ShowImg_From_Flash(x, y, img_addr[s_count%10]);
#else
	x = STEPS_NUM_X;
	y = STEPS_NUM_Y;
	LCD_ShowImg(x, y, img[s_count/10000]);
	LCD_ShowImg(x, y, img[(s_count%10000)/1000]);
	LCD_ShowImg(x, y, img[(s_count%1000)/100]);
	LCD_ShowImg(x, y, img[(s_count%100)/10]);
	LCD_ShowImg(x, y, img[s_count%10]);
#endif
}

void StepsShowStatus(void)
{
	u16_t s_count;
	u16_t x,y;
#ifdef IMG_FONT_FROM_FLASH
	u32_t img_addr[10] = {IMG_NUM_0_ADDR,IMG_NUM_1_ADDR,IMG_NUM_2_ADDR,IMG_NUM_3_ADDR,IMG_NUM_4_ADDR,
						  IMG_NUM_5_ADDR,IMG_NUM_6_ADDR,IMG_NUM_7_ADDR,IMG_NUM_8_ADDR,IMG_NUM_9_ADDR};
#else
	unsigned char *img[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
#endif

	GetImuSteps(&s_count);

	LCD_Clear(BLACK);

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(STEPS_ICON_X, STEPS_ICON_X, IMG_STEP_ICON_ADDR);
	x = STEPS_NUM_X;
	y = STEPS_NUM_Y;
	LCD_ShowImg_From_Flash(x, y, img_addr[s_count/10000]);
	LCD_ShowImg_From_Flash(x, y, img_addr[(s_count%10000)/1000]);
	LCD_ShowImg_From_Flash(x, y, img_addr[(s_count%1000)/100]);
	LCD_ShowImg_From_Flash(x, y, img_addr[(s_count%100)/10]);
	LCD_ShowImg_From_Flash(x, y, img_addr[s_count%10]);
#else
	//LCD_ShowImg(STEPS_ICON_X, STEPS_ICON_Y, IMG_STEP_ICON);
	x = STEPS_NUM_X;
	y = STEPS_NUM_Y;
	LCD_ShowImg(x, y, img[s_count/10000]);
	LCD_ShowImg(x, y, img[(s_count%10000)/1000]);
	LCD_ShowImg(x, y, img[(s_count%1000)/100]);
	LCD_ShowImg(x, y, img[(s_count%100)/10]);
	LCD_ShowImg(x, y, img[s_count%10]);
#endif
}

void StepsScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_STEPS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATED;

		StepsShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_STEPS].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_STEPS].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		StepsUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
}

void FallShowStatus(void)
{
	u16_t x,y;
	u32_t img_addr;
	u8_t *img;

	LCD_Clear(BLACK);

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_EN_ADDR;
	#else
		//img = IMG_FALL_EN;
	#endif
		x = FALL_EN_TEXT_X;
		y = FALL_CN_TEXT_Y;
		break;
		
